{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "Sept. 2021 - Apr. 2025",
      "school_name": "Toronto Metropolitan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_RohanChedde",
  "highlighted_projects": [
    {
      "description": "Developed mobile gameplay features to be implemented in augmented reality using TypeScript. Leveraged Host to Client messaging to implement multiplayer features. Implemented a user-friendly mobile UI using JavaScript and HTML, providing game elements and information for users to easily interact with the game.",
      "git_url": "https://github.com/rohanchedde/FishingARound",
      "name": "Capstone Project: Augmented Reality (AR) Multiplayer Mobile Game"
    },
    {
      "description": "Developed a real-time basketball action detection and classification using Computer Vision. Used Python to implement machine learning algorithms like Ultralytics YOLOv8 to train the model. Utilized Roboflow for labeling and classifying input for training",
      "git_url": "https://github.com/rohanchedde/Object-Detection-Computer-Vision-Project",
      "name": "Object Detection Computer Vision"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Utilized Linux command lines, Bash Scripts, PostgreSQL and Docker to implement a Linux Cluster Monitoring application. This monitoring system records the harware specifications and monitors resource usage of a node running Rocky Linux in real time. The collected data is stored in a RDBMS.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Rohan Chedde",
  "others": [
    {
      "bullets": [
        "Basketball player",
        "Piano and Guitar player"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Programmed various industry esque projects using the Agile/ Scrum methodology",
      "duration": "July 2025-present",
      "title": "Data Engineer"
    },
    {
      "company": "Kinetika",
      "description": "Developed a web application that enables volleyball coaches to create and manage practice sessions and drills using Webflow for the frontend and a custom RESTful API for backend functionality. Designed a user-friendly interface using HTML, allowing coaches to submit structured content with ease. Handled form submissions with JavaScript, sending user-generated practice data as JSON via HTTP/HTTPS protocols to the custom backend",
      "duration": "June 2025",
      "title": "Freelance Web Developer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Docker",
      "Kubernetes",
      "JavaScript",
      "Google Cloud/ AWS"
    ],
    "familiar": [
      "Ansible",
      "Jenkins",
      "HTML",
      "C",
      "PySpark"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Recent Computer Engineering graduate (April 2025) from Toronto Metropolitan University (formerly Ryerson University) with a strong foundation in Software Engineering and DevOps. Experienced in Agile methodologies and cloud-based development, with hands-on proficiency in tools such as Git, Jenkins, and Docker for streamlined and efficient application deployment. Demonstrates strong problem-solving skills, adaptability, and a commitment to continuous learning. Eager to contribute to impactful software and systems projects by leveraging knowledge in computer architecture, hardware design, cloud computing, and multiple programming languages"
}
